{
    "input_type": "text",
    "content": "The Supreme Court on Wednesday issued detailed guidelines regarding the use and verification of digital evidence in criminal investigations. The guidelines aim to ensure authenticity, prevent tampering, and protect the rights of individuals during electronic data collection.\n\nAccording to the judgment, law enforcement agencies must maintain proper documentation of how digital devices are seized, stored, and examined. The court emphasized the importance of maintaining an unbroken chain of custody and using certified forensic tools for data extraction.\n\nLegal experts said the decision woThe Supreme Court on Wednesday issued detailed guidelines regarding the use and verification of digital evidence in criminal investigations. The guidelines aim to ensure authenticity, prevent tampering, and protect the rights of individuals during electronic data collection.\n\nAccording to the judgment, law enforcement agencies must maintain proper documentation of how digital devices are seized, stored, and examined. The court emphasized the importance of maintaining an unbroken chain of custody and using certified forensic tools for data extraction.\n\nLegal experts said the decision would improve transparency in cybercrime investigations and reduce the chances of wrongful convictions based on manipulated digital records. The court also directed lower courts to undergo training programs related to digital forensics.\n\nThe guidelines will apply to all ongoing and future cases where electronic records are presented as evidence, ensuring uniform legal standards across the country.uld improve transparency in cybercrime investigations and reduce the chances of wrongful convictions based on manipulated digital records. The court also directed lower courts to undergo training programs related to digital forensics.\n\nThe guidelines will apply to all ongoing and future cases where electronic records are presented as evidence, ensuring uniform legal standards across the country.",
    "analysis": {
        "credibility_score": 49,
        "factual_accuracy": {
            "score": 49,
            "factual_issues": [
                "Potential misinformation detected by ML model"
            ]
        },
        "source_credibility": {
            "score": 39,
            "source_analysis": "ML model prediction: FAKE. Source credibility questionable based on text patterns."
        },
        "bias_detection": {
            "score": 29,
            "bias_type": "potential",
            "bias_analysis": "Text patterns indicate potential bias or misleading information."
        },
        "clickbait_detection": {
            "score": 19,
            "clickbait_analysis": "Content may contain clickbait or sensationalist elements."
        },
        "insights": "The ML model indicates this content appears to be FAKE news with 51% confidence based on text analysis patterns. Exercise caution and verify from reliable sources.",
        "recommendations": [
            "Cross-check with established news sources",
            "Verify claims with fact-checking websites",
            "Be skeptical of sensational claims",
            "Check the publication date and source credibility"
        ],
        "ml_model_label": "FAKE"
    },
    "timestamp": "2026-01-11T03:15:15.329255"
}