{
    "input_type": "url",
    "url": "https://therealnews.com/trump-invades-venezuela-kidnaps-maduro-and-hurls-the-western-hemisphere-into-chaos",
    "content": "Get fearless, uncompromising truth in your inbox. Subscribe to The Real News. Sign up In the early hours of Saturday morning, Venezuelans were jolted from sleep by the sounds of bombs falling. Video after shocking video shared over WhatsApp and social media captured the pre-dawn scenes of chaos: US helicopters whirling overhead, missile strikes, explosions across the capital Caracas and in three other states. 🔴 AHORA: Aviones militares sobrevuelan Caracas. Se reportan explosiones en zonas aledañas a la Base Aérea La Carlota y Fuerte Tiuna. pic.twitter.com/yqM2kqHiXs— Gabriel Bastidas (@Gbastidas) January 3, 2026 THE U.S. IS BOMBING VENEZUELA!Explosions were heard over Caracas, according to comrades on the ground at Venezuelanalysis, amid unprecedented aggressive threats from the U.S. government under Donald Trump.This is what “foreign policy” looks like under U.S. imperialism:… pic.twitter.com/IiG1b0yqQH— Sovereign Media (@sov_media) January 3, 2026 Strikes against the 4F Barracks in the mountains overlooking Venezuela’s capital of Caracas, which houses a museum and the Mausoleum of Venezuelan politician, revolutionary, and military officer Hugo Chávez. pic.twitter.com/xJwiM6EN6Q— OSINTdefender (@sentdefender) January 3, 2026 President Donald Trump said over social media that the US had “captured” Venezuelan President Nicolas Maduro and his wife Cilia Adela Flores de Maduro amid a “large-scale” strike against the country. That news was confirmed by Venezuelan Vice President Delcy Rodriguez, who also demanded Trump provide proof that Maduro and Flores are still alive. This is the first US invasion of another country in Latin America since the 1989 invasion of Panama, when the US kidnapped and detained Panamanian President Manuel Noriega under charges of drug trafficking. The Trump administration used the same excuse today to detain Maduro, despite lack of evidence linking Maduro to drug trafficking, despite the fact that Trump recently pardoned former Honduran President Juan Orlando Hernández of his own drug trafficking conviction, and despite the fact that Trump broke international law and, according to lawmakers in his own party, violated the US Constitution to carry out Saturday’s operation. As I explained, at length, in the latest episode of my podcast Under the Shadow, Trump’s attacks on Venezuela mark our return to a terrifying, not-so-distant past when the United States felt emboldened and entitled to carry out unilateral military action against sovereign nations to achieve its goals: Trump’s Monroe Doctrine 2.0. But with this strike, the United States has taken an unprecedented step: this is the first time the United States has used its own military to invade a South American country. The US military operation in Venezuela has ended for now, but the seismic political fallout is unfolding in real time. Residents of Caracas tell me they are exhausted and scared. Many did not sleep last night, and electricity is still out in some neighborhoods. Some Venezuelans who opposed Maduro celebrated the attack over social media. This morning, Venezuelan supporters of Maduro hit the streets to protest the US invasion and Maduro’s kidnapping. Marches and protests are being planned in the United States and elsewhere. Venezuelans are taking to the streets against the US overnight invasion that saw bombs fall across the country and resulted in the kinapping of president @NicolasMaduro and his wife. #Venezuela. https://t.co/SZ5yKuOlHZ— Michael Fox (@mfox_us) January 3, 2026 Top Venezuelan officials have called for calm and unity. “Let’s not fall into their provocation,” said Venezuelan Minister of Interior Diosdado Cabello, flanked by members of the Venezuelan armed forces, in a video shared over social media. “Let us not fall into despair. Let us have all the answers, and at the end of this battle, the people of Venezuela will emerge victorious. At the end of these attacks, we will prevail. Long live the homeland! Long live the homeland forever!” In an address to the nation, Venezuelan Minister of Defense Vladimir Padrino López denounced the “criminal military aggression,” and said that the country’s armed forces would be mobilizing across the country. Numerous Latin American leaders have denounced the attack, including Chilean President Gabriel Boric, Mexican President Claudia Sheinbaum, and Colombian President Gustavo Petro, who wrote that Colombia “rejects the aggression against the sovereignty of Venezuela and of Latin America.” “The bombings on Venezuelan territory and the capture of its president cross an unacceptable line,” Brazilian President Luiz Inácio Lula da Silva stated in a post online. “These acts represent a grave affront to Venezuela’s sovereignty and yet another extremely dangerous precedent for the entire international community.” Brazilian president @LulaOficial responds to the US invasion of #Venezuela: \"The bombings on Venezuelan territory and the capture of its president cross an unacceptable line. These acts represent a grave affront to Venezuela's sovereignty and yet another extremely dangerous… https://t.co/TAs5wKNNjS— Michael Fox (@mfox_us) January 3, 2026 Lula has called an emergency meeting in his government over the US attack on Venezuela. “The action recalls the worst moments of interference in the politics of Latin America and the Caribbean and threatens the preservation of the region as a zone of peace,” he wrote. “The international community, through the United Nations, needs to respond vigorously to this episode. Brazil condemns these actions and remains available to promote dialogue and cooperation.” The United States has kidnapped Maduro and his wife, invaded and bombed Venezuela, and President Trump claimed Saturday that the US would “run the country” and would be “very strongly involved” in the operation of Venezuela’s oil industry. It’s hard to guess what will happen next. But one thing is clear: The fallout across Latin America will be severe. The United States has once again shown that it has no respect for international borders or the sovereignty of foreign nations, but will act unilaterally and militarily to achieve its own ends by any means necessary. In this case, it’s clear that those ends were not about drug trafficking—if that were Trump’s concern, he wouldn’t have pardoned and released from US prison former Honduran president and convicted drug trafficker Juan Orlando Hernández. “The objective of this attack is none other than to seize Venezuela’s strategic resources, particularly its oil and minerals, in an attempt to forcibly break the Nation’s political independence,” the government of Venezuela said in an official statement released shortly after 3 a.m. Caracas time. The goal is oil, as Trump himself has stated again and again. This is the international extension of Trump’s America First policy. “We want to surround ourselves with good neighbors,” Trump said at Saturday’s press conference, adding that “we’re gonna take back the oil.” “We have to be surrounded by safe, secure countries… and we also have to have energy.” “I would say that if you’re focused on America and America First, you start with your own hemisphere, where we live,” US Secretary of State Marco Rubio told Fox News’ Sean Hannity in early December. At Saturday’s press conference, Rubio also suggested that other Latin American countries—namely, Cuba—may soon experience the same imperialist fate as Venezuela. And, as numerous analysts told me recently, the US is prepared to use its military to force its agenda in the region. “The National Security Strategy that the Trump Administration just published is essentially saying, ‘We’re going to use our military to get more out of Latin America,’” said Alan McPherson, professor of Latin American history at Temple University. But McPherson says this is more than a continuation of US intervention: “You know, in a sort of raw, realist way, it makes sense, because the military is the thing that the United States does the best in the world. Its economy is actually not what it does the best. It’s the military. So it makes sense to use the military as leverage to get more raw resources, more markets. But at the same time, what’s also happening is not a return to the past. It’s an intensification of neoliberalism. Because what really comes out of the national security strategy, at least in terms of Latin America, is that the priority of the US government is US corporations. What essentially this government is saying is that governments are neoliberal puppets of corporations. And so we need to then apply this to foreign policy.” We saw this policy rolled out last night in Venezuela. But Venezuelans on the streets this morning say they will not simply roll over and accept US domination. “Today, we are calling on international institutions to denounce what has happened,” said one Venezuelan woman who turned out to protest last night’s US invasion. “Because the United States is not the police of the world and we Venezuelans are going to prove it. This is not about just a president. This is about a dignified people who are standing up,” she continued. “Long live a free Venezuela!” Related Republish This StoryRepublish our articles for free, online or in print, under a Creative Commons license. Close windowRepublish this articleThis work is licensed under a Creative Commons Attribution-NoDerivatives 4.0 International License. We encourage republication of our original content. Please copy the HTML code in the textbox below, preserving the attribution and link to the article's original location, and only make minor cosmetic edits to the content on your site.Trump invades Venezuela, kidnaps Maduro, and hurls the Western hemisphere into chaos by Michael Fox, The Real News Network January 3, 2026 <h1>Trump invades Venezuela, kidnaps Maduro, and hurls the Western hemisphere into chaos</h1> <p class=\"byline\">by Michael Fox, The Real News Network <br />January 3, 2026</p> <p class=\"has-drop-cap\">In the early hours of Saturday morning, Venezuelans were jolted from sleep by the sounds of bombs falling.&nbsp;</p> <p>Video after shocking video shared over WhatsApp and social media captured the pre-dawn scenes of chaos: US helicopters whirling overhead, missile strikes, explosions across the capital Caracas and in three other states.</p> <figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"> <div class=\"wp-block-embed__wrapper\"> https://twitter.com/Gbastidas/status/2007339917140259298 </div> </figure> <figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"> <div class=\"wp-block-embed__wrapper\"> https://twitter.com/sov_media/status/2007398767129936239 </div> </figure> <figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"> <div class=\"wp-block-embed__wrapper\"> https://twitter.com/sentdefender/status/2007362385775120440 </div> </figure> <p>President Donald Trump said over social media that the US had “captured” Venezuelan President Nicolas Maduro and his wife Cilia Adela Flores de Maduro amid a “large-scale” strike against the country.</p> <figure class=\"wp-block-image size-large\"><img src=\"https://therealnews.com/wp-content/uploads/2026/01/image-1024x473.png\" alt=\"\" class=\"wp-image-339960\" /></figure> <p>That news was confirmed by Venezuelan Vice President Delcy Rodriguez, who also <a href=\"https://thehill.com/policy/international/5670877-venezuela-delcy-rodriguez-nicolas-maduro-capture-trump-us/\" target=\"_blank\" rel=\"noreferrer noopener\">demanded Trump provide proof</a> that Maduro and Flores are still alive.</p> <p>This is the first US invasion of another country in Latin America <a href=\"https://therealnews.com/panama-us-invasion-under-the-shadow-episode-13\" target=\"_blank\" rel=\"noreferrer noopener\">since the 1989 invasion of Panama</a>, when the US kidnapped and detained Panamanian President Manuel Noriega under charges of drug trafficking. </p> <p>The Trump administration used the same excuse today to detain Maduro, despite lack of evidence linking Maduro to drug trafficking, despite the fact that Trump recently pardoned former Honduran President Juan Orlando Hernández of his own drug trafficking conviction, and despite the fact that Trump broke international law and, <a href=\"https://www.cincinnati.com/story/news/local/2026/01/03/thomas-massie-suggests-u-s-strike-on-venezuela-is-unconstitutional/88005720007/\" target=\"_blank\" rel=\"noreferrer noopener\">according to lawmakers in his own party</a>, violated the US Constitution to carry out Saturday’s operation.</p> <p>As I explained, at length, <a href=\"https://therealnews.com/trump-boat-strike-venezuela-monroe-doctrine-2-0\" target=\"_blank\" rel=\"noreferrer noopener\">in the latest episode</a> of my podcast <em>Under the Shadow</em>, Trump’s attacks on Venezuela mark our return to a terrifying, not-so-distant past when the United States felt emboldened and entitled to carry out unilateral military action against sovereign nations to achieve its goals: Trump’s Monroe Doctrine 2.0.</p> <p>But with this strike, the United States has taken an unprecedented step: this is the first time the United States has used its own military to invade a South American country.</p> <div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div> <p class=\"has-drop-cap\">The US military operation in Venezuela has ended for now, but the seismic political fallout is unfolding in real time. Residents of Caracas tell me they are exhausted and scared. Many did not sleep last night, and electricity is still out in some neighborhoods. Some Venezuelans who opposed Maduro celebrated the attack over social media.</p> <p>This morning, Venezuelan supporters of Maduro hit the streets to protest the US invasion and Maduro's kidnapping. Marches and <a href=\"https://www.cbsnews.com/chicago/news/chicago-reactions-military-operation-venezuela/?intcid=CNR-02-0623\" target=\"_blank\" rel=\"noreferrer noopener\">protests</a> are <a href=\"https://www.instagram.com/p/DTCmvpCjfbM/\" target=\"_blank\" rel=\"noreferrer noopener\">being planned</a> in the United States and elsewhere. </p> <figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"> <div class=\"wp-block-embed__wrapper\"> https://twitter.com/mfox_us/status/2007440033767100654 </div> </figure> <p>Top Venezuelan officials have called for calm and unity.</p> <p>“Let's not fall into their provocation,” said Venezuelan Minister of Interior Diosdado Cabello, flanked by members of the Venezuelan armed forces, in a <a href=\"https://x.com/camilapress/status/2007415519595339857\" target=\"_blank\" rel=\"noreferrer noopener\">video shared over social media</a>. “Let us not fall into despair. Let us have all the answers, and at the end of this battle, the people of Venezuela will emerge victorious. At the end of these attacks, we will prevail. Long live the homeland! Long live the homeland forever!”</p> <p>In an <a href=\"https://www.instagram.com/reel/DTC5nDTkS8r/?igsh=MTVxbHRsc2d2anZ6aw==\" target=\"_blank\" rel=\"noreferrer noopener\">address to the nation</a>, Venezuelan Minister of Defense Vladimir Padrino López denounced the “criminal military aggression,” and said that the country’s armed forces would be <a href=\"https://www.instagram.com/p/DTC9O7BDtLO/?igsh=MWR5YzI3eXVlcDQ1MQ==\" target=\"_blank\" rel=\"noreferrer noopener\">mobilizing across the country</a>. </p> <p>Numerous Latin American leaders have denounced the attack, including Chilean President Gabriel Boric, Mexican President Claudia Sheinbaum, and Colombian President Gustavo Petro, <a href=\"https://www.aljazeera.com/news/2026/1/3/world-reacts-to-reported-us-bombing-of-venezuela\" target=\"_blank\" rel=\"noreferrer noopener\">who wrote that</a> Colombia “rejects the aggression against the sovereignty of Venezuela and of Latin America.”</p> <p>“The bombings on Venezuelan territory and the capture of its president cross an unacceptable line,” Brazilian President Luiz Inácio Lula da Silva stated <a href=\"https://x.com/mfox_us/status/2007439515149853096\" target=\"_blank\" rel=\"noreferrer noopener\">in a post online</a>. “These acts represent a grave affront to Venezuela's sovereignty and yet another extremely dangerous precedent for the entire international community.”</p> <figure class=\"wp-block-embed is-type-rich is-provider-twitter wp-block-embed-twitter\"> <div class=\"wp-block-embed__wrapper\"> https://twitter.com/mfox_us/status/2007439515149853096 </div> </figure> <p>Lula has called an emergency meeting in his government over the US attack on Venezuela.&nbsp;</p> <p>“The action recalls the worst moments of interference in the politics of Latin America and the Caribbean and threatens the preservation of the region as a zone of peace,” he wrote. “The international community, through the United Nations, needs to respond vigorously to this episode. Brazil condemns these actions and remains available to promote dialogue and cooperation.”</p> <div style=\"height:25px\" aria-hidden=\"true\" class=\"wp-block-spacer\"></div> <p class=\"has-drop-cap\">The United States has kidnapped Maduro and his wife, invaded and bombed Venezuela, and President Trump claimed Saturday that the US would “<a href=\"https://www.theguardian.com/world/live/2026/jan/03/caracas-explosions-venezuela-maduro-latest-news-updates-live\" target=\"_blank\" rel=\"noreferrer noopener\">run the country</a>” and would be “<a href=\"https://www.theguardian.com/us-news/2026/jan/03/trump-venezuela-oil-industry\" target=\"_blank\" rel=\"noreferrer noopener\">very strongly involved</a>” in the operation of Venezuela’s oil industry. </p> <p>It’s hard to guess what will happen next. But one thing <em>is</em> clear: The fallout across Latin America will be severe. The United States has once again shown that it has no respect for international borders or the sovereignty of foreign nations, but will act unilaterally and militarily to achieve its own ends by any means necessary. </p> <p>In this case, it’s clear that those ends were not about drug trafficking—if that were Trump’s concern, <a href=\"https://www.bbc.com/news/articles/c9qewln7912o\" target=\"_blank\" rel=\"noreferrer noopener\">he wouldn’t have pardoned</a> and released from US prison former Honduran president and convicted drug trafficker Juan Orlando Hernández.</p> <p>“The objective of this attack is none other than to seize Venezuela’s strategic resources, particularly its oil and minerals, in an attempt to forcibly break the Nation’s political independence,” the government of Venezuela said <a href=\"https://x.com/camilapress/status/2007420373642387758\" target=\"_blank\" rel=\"noreferrer noopener\">in an official statement</a> released shortly after 3 a.m. Caracas time. </p> <p>The goal is oil, as <a href=\"https://www.pbs.org/newshour/politics/watch-we-want-it-back-trump-demands-venezuela-return-land-oil-rights-to-u-s\" target=\"_blank\" rel=\"noreferrer noopener\">Trump himself has stated</a> again and again.</p> <p>This is the international extension of Trump’s America First policy. “We want to surround ourselves with good neighbors,” Trump said at <a href=\"https://www.youtube.com/watch?v=JonFGu3ySo8\" target=\"_blank\" rel=\"noreferrer noopener\">Saturday’s press conference</a>, adding that “we’re gonna take back the oil.” “We have to be surrounded by safe, secure countries… and we also have to have energy.” </p> <p>“I would say that if you’re focused on America and America First, you start with your own hemisphere, where we live,” US Secretary of State Marco Rubio <a href=\"https://therealnews.com/trump-boat-strike-venezuela-monroe-doctrine-2-0\" target=\"_blank\" rel=\"noreferrer noopener\">told Fox News’ Sean Hannity in early December</a>. At Saturday’s press conference, Rubio also suggested that other Latin American countries—namely, Cuba—may soon experience the same imperialist fate as Venezuela. </p> <p>And, as numerous analysts told me recently, the US is prepared to use its military to force its agenda in the region.</p> <p>“The National Security Strategy that the Trump Administration just published is essentially saying, ‘We’re going to use our military to get more out of Latin America,’” <a href=\"https://therealnews.com/trump-boat-strike-venezuela-monroe-doctrine-2-0\" target=\"_blank\" rel=\"noreferrer noopener\">said Alan McPherson</a>, professor of Latin American history at Temple University. But McPherson says this is more than a continuation of US intervention:</p> <blockquote class=\"wp-block-quote\"> <p>“You know, in a sort of raw, realist way, it makes sense, because the military is the thing that the United States does the best in the world. Its economy is actually not what it does the best. It’s the military. So it makes sense to use the military as leverage to get more raw resources, more markets. But at the same time, what’s also happening is not a return to the past. It’s an intensification of neoliberalism. Because what really comes out of the national security strategy, at least in terms of Latin America, is that the priority of the US government is US corporations. What essentially this government is saying is that governments are neoliberal puppets of corporations. And so we need to then apply this to foreign policy.”</p> </blockquote> <p>We saw this policy rolled out last night in Venezuela.</p> <p>But Venezuelans on the streets this morning say they will not simply roll over and accept US domination.&nbsp;</p> <p>“Today, we are calling on international institutions to denounce what has happened,” <a href=\"https://x.com/mfox_us/status/2007440033767100654\" target=\"_blank\" rel=\"noreferrer noopener\">said one Venezuelan woman</a> who turned out to protest last night's US invasion. “Because the United States is not the police of the world and we Venezuelans are going to prove it. This is not about just a president. This is about a dignified people who are standing up,” she continued. “Long live a free Venezuela!”</p> <p>This &lt;a target=&quot;_blank&quot; href=&quot;https://therealnews.com/trump-invades-venezuela-kidnaps-maduro-and-hurls-the-western-hemisphere-into-chaos&quot;&gt;article&lt;/a&gt; first appeared on &lt;a target=&quot;_blank&quot; href=&quot;https://therealnews.com&quot;&gt;The Real News Network&lt;/a&gt; and is republished here under a &lt;a target=&quot;_blank&quot; href=&quot;https://creativecommons.org/licenses/by-nd/4.0/&quot;&gt;Creative Commons Attribution-NoDerivatives 4.0 International License&lt;/a&gt;.&lt;img src=&quot;https://i0.wp.com/therealnews.com/wp-content/uploads/2021/11/cropped-TRNN-2021-logomark-square.png?resize=150%2C150&amp;amp;ssl=1&quot; style=&quot;width:1em;height:1em;margin-left:10px;&quot;&gt;</p> &lt;img id=&quot;republication-tracker-tool-source&quot; src=&quot;https://therealnews.com/?republication-pixel=true&amp;post=339958&amp;amp;ga4=G-7LYS8R7V51&quot; style=&quot;width:1px;height:1px;&quot;&gt;&lt;script&gt; PARSELY = { autotrack: false, onload: function() { PARSELY.beacon.trackPageView({ url: &quot;https://therealnews.com/trump-invades-venezuela-kidnaps-maduro-and-hurls-the-western-hemisphere-into-chaos&quot;, urlref: window.location.href }); } } &lt;/script&gt; &lt;script id=&quot;parsely-cfg&quot; src=&quot;//cdn.parsely.com/keys/therealnews.com/p.js&quot;&gt;&lt;/script&gt; Copy to Clipboard 1 Michael Fox Michael Fox is a Latin America-based media maker and the former director of video production at teleSUR English. More by Michael Fox",
    "analysis": {
        "credibility_score": 28,
        "factual_accuracy": {
            "score": 28,
            "factual_issues": [
                "Potential misinformation detected by ML model"
            ]
        },
        "source_credibility": {
            "score": 18,
            "source_analysis": "ML model prediction: FAKE. Source credibility questionable based on text patterns. Domain: therealnews.com"
        },
        "bias_detection": {
            "score": 8,
            "bias_type": "potential",
            "bias_analysis": "Text patterns indicate potential bias or misleading information."
        },
        "clickbait_detection": {
            "score": 0,
            "clickbait_analysis": "Content may contain clickbait or sensationalist elements."
        },
        "insights": "The ML model indicates this content appears to be FAKE news with 72% confidence based on text analysis patterns. Exercise caution and verify from reliable sources.",
        "recommendations": [
            "Cross-check with established news sources",
            "Verify claims with fact-checking websites",
            "Be skeptical of sensational claims",
            "Check the publication date and source credibility"
        ],
        "ml_model_label": "FAKE"
    },
    "timestamp": "2026-01-11T02:38:17.559668"
}