{
    "input_type": "url",
    "url": "https://therealnews.com/hands-off-venezuela-baltimoreans-protest-trump-invasion",
    "content": "Get fearless, uncompromising truth in your inbox. Subscribe to The Real News. Sign up Around 100 Baltimore residents and local organizers marched through the streets of downtown on Saturday, Jan. 3, to protest the Trump regime’s lawless military invasion of the sovereign country of Venezuela and kidnapping of Venezuelan President Nicolás Maduro and his wife Cilia Flores. Numerous organizations were represented at the protest, including: Party for Socialism and Liberation – Baltimore, the People’s Power Assembly, Black Alliance for Peace, Veterans for Peace, and more. Here’s what the protest looked and sounded like on the ground… Additional links/info: Michael Fox, The Real News Network, “Trump invades Venezuela, kidnaps Maduro, and hurls the Western hemisphere into chaos” Credits: Production/Post-Production: Maximillian Alvarez Transcript The following is a rushed transcript and may contain errors. A proofread version will be made available as soon as possible. Crowd Chants: No more coups, no more war. Venezuela is it yours. Venezuela isn’t yours. Venezuela isn’t yours. Hands off Venezuela. Hands off Venezuela. Maximillian Alvarez: I’m here in downtown Baltimore on Saturday, January 3rd. It’s a little after 3:00 PM and dozens and dozens of Baltimore residents and local organizers are marching through the streets of downtown in protest of the Trump regime’s lawless invasion of Venezuela and kidnapping of its president Nicolas Maduro earlier this morning. I’m here on the ground for The Real News Network. Protestor 1: I’m just out here today because I’m outraged because I’m in disbelief that our country’s being run by this person that does whatever the F he wants and it’s shocking, it’s scary and I’m terrified. So this is what I’m doing. I’m doing what I can. Protestor 2: I’m a cadre member of an organization called the All African People’s Revolutionary Party. My comrade here, Nancy is also a wife and comrade in the party. We’re out here because we’re a socialist revolutionary organization. This is about Venezuela here today. And we know that they’re after the damn oil and that’s all it is. They just know that they can’t count on oil coming through the Persian Gulf. They got too many other forces to deal with. They got to take some domination in the Western hemisphere so they can just go straight through the Gulf of Mexico. And that’s where all the refineries are. I see, understand that Venezuelan oil is all crude oil. And those refineries set up in the Gulf of Mexico, not the Gulf of America. The Gulf of Mexico said what were developed to refine crude oil. And that’s where the crude oil, that’s why they say that’s their oil, that the people of Venezuela stole it from them. Anyway, thank you so much. I’m getting too long winded. Thank you. Protestor 3: This country for hundreds of years has been doing shit like this. And now people are finally aware of it, I feel like. And I’m glad so many people have come out here, but it just has to stop. And the more people that show up to stuff like this, the better. So please keep coming out to events. Share with everyone you know. Hadley Anthony: My name is Hadley Anthony. I live here in Baltimore. I’m running for a Maryland Seventh Congressional District in the Democratic Primary. It’s so important that we’re out here today because we are watching the Trump administration commit murder out in the open seas, illegally invade and attack a sovereign nation and undermine security, not just for us, but also for all of the region. Because these illegal attacks are going to cause so much death and destruction. We cannot just go into these countries time and time again. We have seen how we have failed when we have tried to overthrow and do coups throughout the past decades. And so we have to make sure that we are out here consistently. Our Democratic leaders, we have to have an opposition party. They have to be calling for the impeachment and removal of these war criminals because even if it’s not going to happen immediately, the American people have to see actual resistance and being able to stand up to that. And so I’m so grateful to see over a hundred plus people here in Baltimore seeking up and standing up for not just our ability to provide for our own people, right? We’re spending all this money on foreign entanglements when we don’t even have our residents here in Baltimore, our unhoused, do not have their food insecure. All of these things are compounding on top of each other and we waste all this money. Crowd Chants: US out of everywhere. US out of everywhere. No boots on the ground. No bomb in the air. US out of everywhere. Jake Ecker (PSL – Baltimore): Kidnapping the president ahead of state, a clear war crime was tried by the US in 2002. They kidnapped Hugo Chavez. He was back in the presidential palace within 48 hours. Venezuela knows how to defeat an attack like this. And we will stand with them every step of the way to say that this war, that every bomb drop is not for us. This is for Trump and the billionaires. And we are here to stand against that and say that Baltimore stands with the people of Venezuela, that we are against war. Ellen Barfield (Veterans for Peace): Another war based on lies that killed millions just like Iraq, Afghanistan, Vietnam. We see through the familiar justifications just as the weapons of mass destruction narrative led to the horrors in Iraq. That continue today. It is a destroyed state. Today’s war on drugs, “The rationale rings exceedingly hollow, especially after Trump’s recent pardon of a major drug trafficker.” Please. A war of Venezuela is patently illegal. The UN charter declares no country has the right to intervene overtly or covertly in internal affairs of another nation, but the US does it all the time. Often semi-quietly, sometimes blatantly like now. Veterans repeats demands that the US government withdraw its military forces from the Caribbean and abandon its campaign of regime change and war against Venezuela. We call on all US military personnel to fulfill their legal and obligation to refuse unlawful orders to participate in illegal wars or war crimes. Milan (Black Alliance for Peace): The Black Alliance for Peace strongly condemns the international lawlessness of the neofascist US, the violent aggression and blatant attacks from the people- centered human rights of Venezuelans and violations of Venezuelala sovereignty. The Rogue Empire has also kidnapped Venezuelan President Nicola Maduro and First Lady Celia Flores and is allegedly taking them to New York to prosecute them in US courts. This cowardly and blatantly illegal act reminds us all of the kidnapping of John Bertrand, Aristid from Haiti in 2004. A move that kicked off the ongoing US-led occupation of Haiti, as well as the US invasion of Panama in 1989. The objective of this attack is none other than to seize Venezuela strategic resources, particularly its oil and minerals, attempting to break the nation’s political independence by force. This imperialist intervention has been made possible because of the complete abdication of any semblance of international law after over two years of genocide in Gaza. The development of methods of imperialist intervention tested on nations like Haiti that have long violated the Declaration of the Americas as a zone of peace, the acquiescence of regional governments to the Americas to US military buildup in the Caribbean and subversion throughout the hemisphere, the ongoing colonial occupation of Puerto Rico and the bipartisan intensification of repression domestically throughout the United States. Presence (All-African People’s Revolutionary Party: We demand an anti this imperialist aggression in Venezuela. We demand an immediate halt to all US aggression in Venezuela through its military attacks. We demand the immediate lifting of all illegal sanctions, blockades, and other forms of imperialist aggression. We demand accountability for the attack that resulted in the deaths of over a hundred people off the coast of Venezuela and Columbia in these most recent attacks. We call for the establishment of Azona peace in the Americas and the removal of US/NATO military forces from the global south. Neither US attempts to claim the oil of Venezuela nor Spursis claims of narco terrorism cannot stand as the reader for war in Venezuela. We urge all workers, students, trade unions, youth movements, revolutionary parties and religious organizations throughout the world to come together with Venezuela and other forces globally to coordinate our struggle against imperialism. Hands off Venezuela, death to US and global imperialism in the Americas and around the world, the people united can never be defeated. Thank you. Crowd Chants: Not another penny, not another dollar. Not another dollar. We won’t pay for war and slaughter. We won’t pay for war and slaughter. Not another penny, not another dollar. Not another penny, not another dollar. We won’t pay for war and slaughter. Related Republish This StoryRepublish our articles for free, online or in print, under a Creative Commons license. Close windowRepublish this articleThis work is licensed under a Creative Commons Attribution-NoDerivatives 4.0 International License. We encourage republication of our original content. Please copy the HTML code in the textbox below, preserving the attribution and link to the article's original location, and only make minor cosmetic edits to the content on your site.‘Hands off Venezuela!’: Baltimoreans protest Trump invasion by Maximillian Alvarez, The Real News Network January 5, 2026 <h1>‘Hands off Venezuela!’: Baltimoreans protest Trump invasion</h1> <p class=\"byline\">by Maximillian Alvarez, The Real News Network <br />January 5, 2026</p> <br /> <figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"> <div class=\"wp-block-embed__wrapper\"> https://youtu.be/ij-OC884vIU </div> </figure> <p class=\"has-drop-cap\">Around 100 Baltimore residents and local organizers marched through the streets of downtown on Saturday, Jan. 3, to protest the Trump regime's lawless military invasion of the sovereign country of Venezuela and kidnapping of Venezuelan President Nicolás Maduro and his wife Cilia Flores. Numerous organizations were represented at the protest, including: Party for Socialism and Liberation - Baltimore, the People's Power Assembly, Black Alliance for Peace, Veterans for Peace, and more. Here’s what the protest looked and sounded like on the ground…</p> <p><strong>Additional links/info:</strong></p> <ul class=\"wp-block-list\"> <li>Michael Fox, The Real News Network, “<a href=\"https://therealnews.com/trump-invades-venezuela-kidnaps-maduro-and-hurls-the-western-hemisphere-into-chaos\" target=\"_blank\" rel=\"noreferrer noopener\">Trump invades Venezuela, kidnaps Maduro, and hurls the Western hemisphere into chaos</a>”</li> </ul> <p><strong>Credits:</strong></p> <ul class=\"wp-block-list\"> <li>Production/Post-Production: Maximillian Alvarez</li> </ul> <details class=\"wp-block-details\"> <summary>Transcript</summary> <p><em>The following is a rushed transcript and may contain errors. A proofread version will be made available as soon as possible.</em></p> <p>Crowd Chants:</p> <p>No more coups, no more war. Venezuela is it yours. Venezuela isn't yours. Venezuela isn't yours. Hands off Venezuela. Hands off Venezuela.</p> <p>Maximillian Alvarez:</p> <p>I'm here in downtown Baltimore on Saturday, January 3rd. It's a little after 3:00 PM and dozens and dozens of Baltimore residents and local organizers are marching through the streets of downtown in protest of the Trump regime's lawless invasion of Venezuela and kidnapping of its president Nicolas Maduro earlier this morning. I'm here on the ground for The Real News Network.</p> <p>Protestor 1:</p> <p>I'm just out here today because I'm outraged because I'm in disbelief that our country's being run by this person that does whatever the F he wants and it's shocking, it's scary and I'm terrified. So this is what I'm doing. I'm doing what I can.</p> <p>Protestor 2:</p> <p>I'm a cadre member of an organization called the All African People's Revolutionary Party. My comrade here, Nancy is also a wife and comrade in the party. We're out here because we're a socialist revolutionary organization. This is about Venezuela here today. And we know that they're after the damn oil and that's all it is. They just know that they can't count on oil coming through the Persian Gulf. They got too many other forces to deal with. They got to take some domination in the Western hemisphere so they can just go straight through the Gulf of Mexico. And that's where all the refineries are. I see, understand that Venezuelan oil is all crude oil. And those refineries set up in the Gulf of Mexico, not the Gulf of America. The Gulf of Mexico said what were developed to refine crude oil.</p> <p>And that's where the crude oil, that's why they say that's their oil, that the people of Venezuela stole it from them. Anyway, thank you so much. I'm getting too long winded. Thank you.</p> <p>Protestor 3:</p> <p>This country for hundreds of years has been doing shit like this. And now people are finally aware of it, I feel like. And I'm glad so many people have come out here, but it just has to stop. And the more people that show up to stuff like this, the better. So please keep coming out to events. Share with everyone you know.</p> <p>Hadley Anthony:</p> <p>My name is Hadley Anthony. I live here in Baltimore. I'm running for a Maryland Seventh Congressional District in the Democratic Primary. It's so important that we're out here today because we are watching the Trump administration commit murder out in the open seas, illegally invade and attack a sovereign nation and undermine security, not just for us, but also for all of the region. Because these illegal attacks are going to cause so much death and destruction. We cannot just go into these countries time and time again. We have seen how we have failed when we have tried to overthrow and do coups throughout the past decades. And so we have to make sure that we are out here consistently. Our Democratic leaders, we have to have an opposition party. They have to be calling for the impeachment and removal of these war criminals because even if it's not going to happen immediately, the American people have to see actual resistance and being able to stand up to that.</p> <p>And so I'm so grateful to see over a hundred plus people here in Baltimore seeking up and standing up for not just our ability to provide for our own people, right? We're spending all this money on foreign entanglements when we don't even have our residents here in Baltimore, our unhoused, do not have their food insecure. All of these things are compounding on top of each other and we waste all this money.</p> <p>Crowd Chants:</p> <p>US out of everywhere. US out of everywhere. No boots on the ground. No bomb in the air. US out of everywhere.</p> <p>Jake Ecker (PSL - Baltimore):</p> <p>Kidnapping the president ahead of state, a clear war crime was tried by the US in 2002. They kidnapped Hugo Chavez. He was back in the presidential palace within 48 hours. Venezuela knows how to defeat an attack like this. And we will stand with them every step of the way to say that this war, that every bomb drop is not for us. This is for Trump and the billionaires. And we are here to stand against that and say that Baltimore stands with the people of Venezuela, that we are against war.</p> <p>Ellen Barfield (Veterans for Peace):</p> <p>Another war based on lies that killed millions just like Iraq, Afghanistan, Vietnam. We see through the familiar justifications just as the weapons of mass destruction narrative led to the horrors in Iraq. That continue today. It is a destroyed state. Today's war on drugs, \"The rationale rings exceedingly hollow, especially after Trump's recent pardon of a major drug trafficker.\" Please. A war of Venezuela is patently illegal. The UN charter declares no country has the right to intervene overtly or covertly in internal affairs of another nation, but the US does it all the time. Often semi-quietly, sometimes blatantly like now. Veterans repeats demands that the US government withdraw its military forces from the Caribbean and abandon its campaign of regime change and war against Venezuela. We call on all US military personnel to fulfill their legal and obligation to refuse unlawful orders to participate in illegal wars or war crimes.</p> <p>Milan (Black Alliance for Peace):</p> <p>The Black Alliance for Peace strongly condemns the international lawlessness of the neofascist US, the violent aggression and blatant attacks from the people- centered human rights of Venezuelans and violations of Venezuelala sovereignty. The Rogue Empire has also kidnapped Venezuelan President Nicola Maduro and First Lady Celia Flores and is allegedly taking them to New York to prosecute them in US courts. This cowardly and blatantly illegal act reminds us all of the kidnapping of John Bertrand, Aristid from Haiti in 2004. A move that kicked off the ongoing US-led occupation of Haiti, as well as the US invasion of Panama in 1989. The objective of this attack is none other than to seize Venezuela strategic resources, particularly its oil and minerals, attempting to break the nation's political independence by force. This imperialist intervention has been made possible because of the complete abdication of any semblance of international law after over two years of genocide in Gaza.</p> <p>The development of methods of imperialist intervention tested on nations like Haiti that have long violated the Declaration of the Americas as a zone of peace, the acquiescence of regional governments to the Americas to US military buildup in the Caribbean and subversion throughout the hemisphere, the ongoing colonial occupation of Puerto Rico and the bipartisan intensification of repression domestically throughout the United States.</p> <p>Presence (All-African People's Revolutionary Party:</p> <p>We demand an anti this imperialist aggression in Venezuela. We demand an immediate halt to all US aggression in Venezuela through its military attacks. We demand the immediate lifting of all illegal sanctions, blockades, and other forms of imperialist aggression. We demand accountability for the attack that resulted in the deaths of over a hundred people off the coast of Venezuela and Columbia in these most recent attacks. We call for the establishment of Azona peace in the Americas and the removal of US/NATO military forces from the global south. Neither US attempts to claim the oil of Venezuela nor Spursis claims of narco terrorism cannot stand as the reader for war in Venezuela. We urge all workers, students, trade unions, youth movements, revolutionary parties and religious organizations throughout the world to come together with Venezuela and other forces globally to coordinate our struggle against imperialism. Hands off Venezuela, death to US and global imperialism in the Americas and around the world, the people united can never be defeated. Thank you.</p> <p>Crowd Chants:</p> <p>Not another penny, not another dollar. Not another dollar. We won't pay for war and slaughter. We won't pay for war and slaughter. Not another penny, not another dollar. Not another penny, not another dollar. We won't pay for war and slaughter.</p> </details> <p>This &lt;a target=&quot;_blank&quot; href=&quot;https://therealnews.com/hands-off-venezuela-baltimoreans-protest-trump-invasion&quot;&gt;article&lt;/a&gt; first appeared on &lt;a target=&quot;_blank&quot; href=&quot;https://therealnews.com&quot;&gt;The Real News Network&lt;/a&gt; and is republished here under a &lt;a target=&quot;_blank&quot; href=&quot;https://creativecommons.org/licenses/by-nd/4.0/&quot;&gt;Creative Commons Attribution-NoDerivatives 4.0 International License&lt;/a&gt;.&lt;img src=&quot;https://i0.wp.com/therealnews.com/wp-content/uploads/2021/11/cropped-TRNN-2021-logomark-square.png?resize=150%2C150&amp;amp;ssl=1&quot; style=&quot;width:1em;height:1em;margin-left:10px;&quot;&gt;</p> &lt;img id=&quot;republication-tracker-tool-source&quot; src=&quot;https://therealnews.com/?republication-pixel=true&amp;post=339995&amp;amp;ga4=G-7LYS8R7V51&quot; style=&quot;width:1px;height:1px;&quot;&gt;&lt;script&gt; PARSELY = { autotrack: false, onload: function() { PARSELY.beacon.trackPageView({ url: &quot;https://therealnews.com/hands-off-venezuela-baltimoreans-protest-trump-invasion&quot;, urlref: window.location.href }); } } &lt;/script&gt; &lt;script id=&quot;parsely-cfg&quot; src=&quot;//cdn.parsely.com/keys/therealnews.com/p.js&quot;&gt;&lt;/script&gt; Copy to Clipboard 1 Maximillian AlvarezEditor-in-Chief Editor-in-Chief Ten years ago, I was working 12-hour days as a warehouse temp in Southern California while my family, like millions of others, struggled to stay afloat in the wake of the Great Recession. Eventually, we lost everything, including the house I grew up in. It was in the years that followed, when hope seemed irrevocably lost and help from above seemed impossibly absent, that I realized the life-saving importance of everyday workers coming together, sharing our stories, showing our scars, and reminding one another that we are not alone. Since then, from starting the podcast Working People—where I interview workers about their lives, jobs, dreams, and struggles—to working as Associate Editor at the Chronicle Review and now as Editor-in-Chief at The Real News Network, I have dedicated my life to lifting up the voices and honoring the humanity of our fellow workers. Email: max@therealnews.com Follow: @maximillian_alv More by Maximillian Alvarez",
    "analysis": {
        "credibility_score": 48,
        "factual_accuracy": {
            "score": 48,
            "factual_issues": [
                "Potential misinformation detected by ML model"
            ]
        },
        "source_credibility": {
            "score": 38,
            "source_analysis": "ML model prediction: FAKE. Source credibility questionable based on text patterns. Domain: therealnews.com"
        },
        "bias_detection": {
            "score": 28,
            "bias_type": "potential",
            "bias_analysis": "Text patterns indicate potential bias or misleading information."
        },
        "clickbait_detection": {
            "score": 18,
            "clickbait_analysis": "Content may contain clickbait or sensationalist elements."
        },
        "insights": "The ML model indicates this content appears to be FAKE news with 52% confidence based on text analysis patterns. Exercise caution and verify from reliable sources.",
        "recommendations": [
            "Cross-check with established news sources",
            "Verify claims with fact-checking websites",
            "Be skeptical of sensational claims",
            "Check the publication date and source credibility"
        ],
        "ml_model_label": "FAKE"
    },
    "timestamp": "2026-01-11T01:56:09.411724"
}